Repository: dotnet/razor
Catalog: src/Razor/src/Microsoft.CodeAnalysis.Remote.Razor/Resources/xlf/*.*.xlf
Languages: sr

source: '{0}' is not a Razor file path.
sr: '{0}' não é um caminho de arquivo Razor.

# Couldnt_get_a_source_generator_run_result
source: Couldn't get a source generator run result for project '{0}'.
sr: Não foi possível obter um resultado de execução do gerador de código-fonte para o projeto '{0}'.

# Couldnt_get_the_source_generated_document_for_hint_name
source: Couldn't get the source generated document for hint name '{0}' that we got from the generator run result.
sr: Não foi possível obter o documento gerado a partir do código-fonte para o nome de dica '{0}' que recebemos do resultado da execução do gerador.

source: Document does not belong to this project.
sr: O documento não pertence a esse projeto.

source: Document is not a Razor document.
sr: O documento não é um documento Razor.

# Generator_run_result_did_not_contain_a_code_document
source: Generator run result did not contain a code document for '{0}'.
sr: O resultado da execução do gerador não continha um documento de código para '{0}'.

source: Project does not belong to this solution.
sr: O projeto não pertence a essa solução.

source: Project does not contain any Razor documents.
sr: O projeto não contém documentos Razor.

# Razor_source_generator_did_not_produce_a_host_output
source: Razor source generator did not produce a host output for project '{0}': {1}
sr: O gerador de código-fonte Razor não produziu uma saída de host para o projeto '{0}': {1}

# Razor_source_generator_host_output_is_not_RazorGeneratorResult
source: Razor source generator host output is not of type RazorGeneratorResult for project '{0}': {1}
sr: A saída de host do gerador de código-fonte Razor não é do tipo RazorGeneratorResult para o projeto '{0}': {1}

# Razor_source_generator_is_not_referenced
source: Razor source generator is not referenced or no run result found for project '{0}'.
sr: O gerador de código-fonte Razor não está referenciado ou nenhum resultado de execução foi encontrado para o projeto '{0}'.

# Razor_source_generator_reference_incorrect
source: Razor source generator is referenced from '{0}' but we are expecting '{1}', for project '{2}'.
sr: O gerador de código-fonte Razor é referenciado de '{0}', mas estamos esperando '{1}', para o projeto '{2}'.
