Repository: dotnet/razor
Catalog: src/Razor/src/Microsoft.VisualStudio.RazorExtension/xlf/VSPackage.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Advanced
cs: Rozšířené
de: Erweitert
es: Opciones avanzadas
fr: Avancé
it: Avanzate
ja: 詳細
ko: 고급
pl: Zaawansowane
pt_br: Avançado
ru: Дополнительно
tr: Gelişmiş
zh_hans: 高级
zh_hant: 進階

source: Formatting; Format On Type;
cs: Formátování; Formátovat při psaní;
de: Formatierung; Format bei Eingabe;
es: Formato; Dar formato al escribir;
fr: Formatage; Mettre en forme sur le type ;
it: Formattazione; Formattare durante la digitazione;
ja: 書式設定; 入力時に書式設定;
ko: 서식; 형식의 서식;
pl: Formatowanie; Formatuj według typu;
pt_br: Formatação; Formatar ao Digitar;
ru: Форматирование; Форматировать по типу;
tr: Biçimlendirme; Yazarken Biçimlendir;
zh_hans: 格式设置; 键入时格式设置;
zh_hant: 格式化; 輸入時格式化;

source: Provides languages services for ASP.NET Core Razor.
cs: Poskytuje služby jazyka pro ASP.NET Core Razor.
de: Stellt Sprachdienste für ASP.NET Core Razor bereit.
es: Proporciona servicios de lenguajes para ASP.NET Core Razor.
fr: Fournit des services de langage pour ASP.NET Core Razor.
it: Fornisce servizi di linguaggio per ASP.NET Core Razor.
ja: ASP.NET Core Razor の言語サービスを提供します。
ko: ASP.NET Core Razor용 언어 서비스를 제공합니다.
pl: Oferuje usługi językowe dla składni Razor platformy ASP.NET Core.
pt_br: Fornece serviços de idiomas para ASP.NET Core Razor.
ru: Предоставляет языковые службы для ASP.NET Core Razor.
tr: ASP.NET Core Razor için dil hizmetleri sağlar.
zh_hans: 提供 ASP.NET Core Razor 的语言服务。
zh_hant: 提供 ASP.NET Core Razor 的語言服務。

source: Completion
cs: Dokončení
de: Abschluss
es: Finalización
fr: Complétion
it: Completamento
ja: 入力候補
ko: 완성
pl: Uzupełnianie
pt_br: Conclusão
ru: Завершение
tr: Tamamlama
zh_hans: 完成
zh_hant: 完成

source: Formatting
cs: Formátování
de: Formatierung
es: Formato
fr: Mise en forme
it: Formattazione
ja: 書式設定
ko: 서식
pl: Formatowanie
pt_br: Formatação
ru: Форматирование
tr: Biçimlendirme
zh_hans: 格式设置
zh_hant: 格式化

source: Other
cs: Jiné
de: Andere
es: Otro
fr: Autre
it: Altro
ja: その他
ko: 기타
pl: Inne
pt_br: Outros
ru: Другое
tr: Diğer
zh_hans: 其他
zh_hant: 其他

source: Razor Syntax Visualizer
pl: Syntax Visualizer Razor

# Setting_AutoClosingTagsDescription
source: If true, closing tags will be automatically inserted
cs: Při hodnotě true se budou automaticky vkládat uzavírací značky.
de: Bei "true" werden schließende Tags automatisch eingefügt.
es: Si es verdadero, las etiquetas de cierre se insertarán automáticamente
fr: Si la valeur est true, les balises de fermeture sont automatiquement insérées
it: Se true, i tag di chiusura verranno inseriti automaticamente
ja: true の場合、終了タグは自動的に挿入されます
ko: true이면 닫는 태그가 자동으로 삽입됩니다.
pl: W przypadku wartości true tagi zamykające będą wstawiane automatycznie
pt_br: Se verdadeiro, as tags de fechamento serão inseridas automaticamente
ru: При значении true закрывающие теги вставляются автоматически
tr: True ise, kapanış etiketleri otomatik olarak eklenir
zh_hans: 如果为 true，将自动插入结束标记
zh_hant: 若為 True，將會自動插入結尾標記

# Setting_AutoClosingTagsDisplayName
source: Auto insert closing tag
cs: Automaticky vkládat ukončovací značky
de: Schließendes Tag automatisch einfügen
es: Insertar automáticamente etiqueta de cierre
fr: Insertion automatique de la balise de fermeture
it: Inserisci automaticamente tag di chiusura
ja: 終了タグを自動挿入する
ko: 닫는 태그 자동 삽입
pl: Automatycznie wstaw tag zamykający
pt_br: Inserir automaticamente marca de fechamento
ru: Автоматически вставлять закрывающий тег
tr: Otomatik olarak kapanış etiketi ekle
zh_hans: 自动插入关闭标记
zh_hant: 自動插入結尾標記

# Setting_AutoInsertAttributeQuotesDescription
source: If true, completion on attributes will add quotation marks
cs: Pokud se nastaví na true, doplňování atributů přidá uvozovky.
de: Bei einer Festlegung auf TRUE werden bei der Vervollständigung von Attributen Anführungszeichen hinzugefügt.
es: Si es true, la finalización en los atributos agregará comillas
fr: Si la valeur est true, la complétion sur les attributs ajoute des guillemets
it: Se true, il completamento degli attributi aggiungerà le virgolette
ja: true の場合、属性を入力するとき引用符が追加されます
ko: true인 경우 특성을 완성하면 따옴표가 추가됩니다
pl: Jeśli ma wartość true, uzupełnianie atrybutów spowoduje dodanie cudzysłowów
pt_br: Se for true, a conclusão nos atributos adicionará aspas
ru: Если задано значение true, то при завершении атрибутов будут добавлены кавычки
tr: True ise öznitelikler üzerinde tamamlama tırnak işaretleri ekler
zh_hans: 如果为 true，则特性的完成将添加引号
zh_hant: 如果為 True，屬性完成時將新增引號

# Setting_AutoInsertAttributeQuotesDisplayName
source: Auto insert attribute quotes
cs: Automaticky vkládat uvozovky atributů
de: Anführungszeichen für Attribute automatisch einfügen
es: Insertar automáticamente comillas de atributo
fr: Insérer automatiquement des guillemets d’attribut
it: Inserire automaticamente le virgolette degli attributi
ja: 属性引用符の自動挿入
ko: 특성 따옴표 자동 삽입
pl: Automatyczne wstawianie cudzysłowów atrybutów
pt_br: Inserção automática de citações de atributos
ru: Автоматически вставлять кавычки атрибутов
tr: Öznitelik tırnaklarını otomatik ekle
zh_hans: 自动插入属性引号
zh_hant: 自動插入屬性引用

# Setting_CodeBlockBraceOnNextLineDescription
source: Forces the open brace after an @code or @functions directive to be on the following line
cs: Vynutí, aby levá složená závorka za direktivou @code nebo @functions byla na následujícím řádku
de: Erzwingt, dass die öffnende geschweifte Klammer nach einer @code- oder @functions-Anweisung in der folgenden Zeile steht
es: Fuerza la llave de apertura después de una directiva @code o @functions a estar en la línea siguiente
fr: Force l’accolade ouvrante après une directive @code ou @functions à se trouver sur la ligne suivante
it: Forza la parentesi graffa di apertura dopo una direttiva @code o @functions nella riga seguente
ja: @code または @functions ディレクティブの後の始め中かっこを強制的に次の行にする
ko: @code 또는 @functions 지시문 뒤에 여는 중괄호를 강제로 다음 줄에 표시함
pl: Wymusza, aby otwierający nawias klamrowy po dyrektywie @code lub @functions był w następującym wierszu
pt_br: Força a chave de abertura após uma diretiva @code ou @functions a estar na linha seguinte
ru: Принудительно добавляет открывающую фигурную скобку после директивы @code или @functions на следующей строке
tr: Açık küme ayracını bir @code veya @functions yönergesinden sonra aşağıdaki satırda olmaya zorlar
zh_hans: 强制 @代码 或 @函数指令后的左大括号位于下一行
zh_hant: 強制 @code 或 @functions 指示詞後方的左大括號位於下列行

# Setting_CodeBlockBraceOnNextLineDisplayName
source: Code/functions block open brace on next line
cs: Blok kódu nebo funkcí – otevřít složenou závorku na dalším řádku
de: Code/Funktionen blockieren öffnende Klammer in nächster Zeile
es: Bloquear llave de apertura de código o funciones en la línea siguiente
fr: Le code/les fonctions bloquent l’accolade ouvrante sur la ligne suivante
it: Parentesi graffa di apertura blocco codice/funzioni alla riga successiva
ja: コード/関数は、次の行で始め中かっこをブロックします
ko: 코드/함수는 다음 줄에서 여는 중괄호를 차단함
pl: Otwierający nawias klamrowy bloku kody/funkcji w następnym wierszu
pt_br: Código/funções bloqueiam a chave aberta na próxima linha
ru: Открывающая скобка блока кода/функций на следующей строке
tr: Sonraki satırda kod/İşlevler bloğu açık küme ayracı
zh_hans: 代码/函数块左大括号新行开始
zh_hant: 程式碼/函數區塊左大括弧在下一行

# Setting_ColorBackgroundDescription
source: If true, gives C# code in Razor files a background color
cs: Pokud je hodnota „true“, vrátí kód C# v souborech Razor barvu pozadí.
de: Bei „true“ erhält C#-Code in Razor-Dateien eine Hintergrundfarbe.
es: Si es true, da un color de fondo al código de C# de los archivos de Razor.
fr: Si la valeur est true, donne une couleur d’arrière-plan au code C# dans les fichiers Razor
it: Se true, assegna un colore di sfondo al codice C# nei file Razor
ja: true の場合、Razor ファイルの C# コードに背景色を表示します
ko: true이면 Razor 파일의 C# 코드에 배경색을 지정합니다.
pl: Jeśli ma wartość true, nadaje kolor tła dla kodu języka C# w plikach Razor
pt_br: Se verdadeiro, dá ao código C# nos arquivos Razor uma cor de fundo
ru: Если ИСТИНА, коду C# в файлах Razor присваивается цвет фона.
tr: True ise Razor dosyalarında C# kodu bir arka plan rengi verir
zh_hans: 如果为 true，则为 Razor 文件中的 C# 代码提供背景色
zh_hant: 若為 true，則給予 Razor 檔案中的 C# 程式碼背景色彩

# Setting_ColorBackgroundDisplayName
source: Background for C# code
cs: Pozadí pro kód jazyka C#
de: Hintergrund für C#-Code
es: Fondo de código de C#
fr: Arrière-plan du code C#
it: Sfondo per il codice C#
ja: C# コードの背景
ko: C# 코드의 배경
pl: Tło dla kodu języka C#
pt_br: Plano de fundo do código C#
ru: Фон для кода C#
tr: C# kodu için arka plan
zh_hans: C# 代码的背景
zh_hant: C# 程式碼的背景

# Setting_CommitElementsWithSpaceDescription
source: If true, pressing space will commit suggestions for HTML elements and components
cs: Pokud je true, stisknutím mezerníku se potvrdí návrhy pro elementy a komponenty HTML.
de: Wenn TRUE, werden beim Drücken der LEERTASTE Vorschläge für HTML-Elemente und -Komponenten committet.
es: Si es true, al presionar el espacio se confirmarán sugerencias para los elementos y componentes HTML
fr: Si c'est vrai, appuyer sur espace validera les suggestions d'éléments et de composants HTML
it: Se è true, premendo lo spazio verrà eseguito il commit di suggerimenti per elementi e componenti HTML
ja: true の場合、スペースを押すと HTML 要素とコンポーネントの候補がコミットされます
ko: true일 경우 스페이스바를 누르면 HTML 요소 및 구성 요소에 대한 제안이 커밋됩니다.
pl: Jeśli ma wartość true, naciśnięcie klawisza Spacja spowoduje zatwierdzenie sugestii dotyczących elementów i składników HTML
pt_br: Se verdadeiro, pressionar espaço confirmará as sugestões de elementos e componentes HTML
ru: Если настроено значение true, при нажатии клавиши ПРОБЕЛ будут фиксироваться предложения для HTML-элементов и компонентов
tr: True ise, boşluk çubuğuna basıldığında HTML öğeleri ve bileşenleri ile ilgili öneriler işlenir.
zh_hans: 如果为 true，按空格键将会提交 Html 元素和组件的建议
zh_hant: 若為 true，按下空格鍵將會認可 Html 元素和元件的建議

# Setting_CommitElementsWithSpaceDisplayName
source: Commit elements with space
cs: Potvrzovat elementy mezerníkem
de: Elemente durch Drücken der LEERTASTE committen
es: Confirmar elementos con espacio
fr: Valider des éléments avec de l’espace
it: Eseguire il commit degli elementi con lo spazio
ja: スペースを含む要素のコミット
ko: 공백을 사용하여 요소 커밋
pl: Zatwierdź elementy za pomocą klawisza Spacja
pt_br: Confirmar elementos com espaço
ru: Фиксация элементов клавишей ПРОБЕЛ
tr: Öğeleri boşluk çubuğuyla işle
zh_hans: 使用空格键提交元素
zh_hant: 透過空格鍵認可元素

# Setting_FormattingOnPasteDescription
source: If true, formatting will be enabled when pasting content
cs: Pokud je true, při vkládání obsahu se povolí formátování.
de: „True“ gibt an, dass die Formatierung beim Einfügen von Inhalten aktiviert wird.
es: Si es true, se habilitará la aplicación de formato al pegar contenido
fr: Si la valeur est true, la mise en forme sera activée lors du collage du contenu
it: Se true, la formattazione verrà abilitata quando viene incollato il contenuto
ja: true の場合、コンテンツを貼り付けたときに書式設定が有効になります
ko: true이면 콘텐츠를 붙여넣을 때 서식을 사용할 수 있습니다.
pl: Jeśli wartość jest równa true, formatowanie będzie włączane podczas wklejania zawartości
pt_br: Se for true, a formatação será habilitada ao colar conteúdo
ru: Если ИСТИНА, форматирование будет включено при вставке контента.
tr: Doğru ise içerik yapıştırılırken biçimlendirme etkinleştirilir
zh_hans: 如果为 true，则粘贴内容时将启用格式设置
zh_hant: 如為 true，貼上內容時將啟用格式化

# Setting_FormattingOnPasteDisplayName
source: Format on paste
cs: Formátovat při vložení
de: Beim Einfügen formatieren
es: Dar formato al pegar
fr: Mettre en forme lors du collage
it: Formatta quando si incolla
ja: 貼り付け時に書式設定する
ko: 붙여넣기 시 서식 지정
pl: Formatuj przy wklejeniu
pt_br: Formatar ao colar
ru: Форматировать при вставке
tr: Yapıştırma sırasında biçimlendir
zh_hans: 粘贴时设置格式
zh_hant: 於貼上時格式化

# Setting_FormattingOnTypeDescription
source: If true, formatting will be enabled while typing
cs: Pokud je hodnota true, při psaní se povolí formátování.
de: Bei "true" wird die Formatierung während der Eingabe aktiviert.
es: Si es true, el formato se habilitará al escribir
fr: Si la valeur est true, la mise en forme est activée lors de la saisie
it: Se true, la formattazione verrà abilitata durante la digitazione
ja: true の場合、入力中に書式設定が有効になります
ko: true이면 입력하는 동안 서식을 사용할 수 있습니다.
pl: Jeśli ma wartość „prawda”, formatowanie będzie włączone podczas pisania
pt_br: Se verdadeiro, a formatação será habilitada durante a digitação
ru: Если задано значение true, при вводе текста будет включено форматирование
tr: True ise, yazma sırasında biçimlendirme etkinleştirilir
zh_hans: 如果为 true，则在键入时将启用格式设置
zh_hant: 如果為 True，則會在輸入時啟用格式化

# Setting_FormattingOnTypeDisplayName
source: Format on type
cs: Formátovat při psaní
de: Bei Eingabe formatieren
es: Dar formato al escribir
fr: Mettre en forme sur le type
it: Formattare durante la digitazione
ja: 入力時に書式設定
ko: 형식의 서식
pl: Formatuj według typu
pt_br: Formatar no tipo
ru: Форматировать по типу
tr: Yazarken biçimlendir
zh_hans: 键入时设置格式
zh_hant: 輸入時格式化

# Setting_LogLevelCritical
source: Critical
cs: Kritická
de: Kritisch
es: Crítico
fr: Critique
it: Critico
ja: 重大
ko: 위험
pl: Krytyczny
pt_br: Crítico
ru: Критический
tr: Kritik
zh_hans: 严重
zh_hant: 危急

# Setting_LogLevelDebug
source: Debug
cs: Ladit
de: Debuggen
es: Depuración
fr: Déboguer
ja: デバッグ
ko: 디버그
pl: Debuguj
pt_br: Depurar
ru: Отладка
tr: Hata Ayıkla
zh_hans: 调试
zh_hant: 偵錯

# Setting_LogLevelDescription
source: Sets the level of logging to show in the Razor Logger Output category of the Output Window.
cs: Nastaví úroveň protokolování, která se zobrazí v kategorii výstupu nástroje Razor Logger okna Výstup.
de: Legt den Protokolliergrad fest, der in der Kategorie "Razor-Protokollierungsausgabe" des Ausgabefenster angezeigt wird.
es: Establece el nivel de registro que se va a mostrar en la categoría de salida del registrador de Razor del Ventana de salida.
fr: Définit le niveau de journalisation à afficher dans la catégorie Sortie Razor Logger de la fenêtre de sortie.
it: Imposta il livello di registrazione da mostrare nella categoria di output logger Razor della finestra di output.
ja: 出力ウィンドウの Razor Logger 出力カテゴリに表示するログ記録のレベルを設定します。
ko: 출력 창의 Razor 로거 출력 범주에 표시할 로깅 수준을 설정합니다.
pl: Ustawia poziom rejestrowania, który ma być wyświetlany w kategorii danych wyjściowych rejestratora Razor w oknie Dane wyjściowe.
pt_br: Define o nível de registro em log a ser exibido na categoria Saída do Agente do Razor da Janela de Saída.
ru: Задает уровень ведения журнала для отображения в категории "Выходные данные средства ведения журнала Razor" в окне вывода.
tr: Çıkış Penceresinin Razor Günlük Çıkış kategorisinde gösterilecek günlüğe kaydetme düzeyini ayarlar.
zh_hans: 设置要在输出窗口的“Razor 记录器输出”类别中显示的日志记录级别。
zh_hant: 設定要在輸出視窗的「Razor 記錄器輸出」類別中顯示的記錄層級。

# Setting_LogLevelDisplayName
source: Output Window Log Level
cs: Úroveň protokolu okna Výstup
de: Protokollebene des Ausgabefensters
es: Nivel de registro de la Ventana de salida
fr: Fenêtre Sortie niveau du journal
it: Livello di registrazione finestra di output
ja: 出力ウィンドウ ログ レベル
ko: 출력 창 로그 수준
pl: Poziom dziennika w oknie Dane wyjściowe
pt_br: Nível de log da janela de saída
ru: Уровень ведения журнала для окна вывода
tr: Çıkış Penceresi Günlük Düzeyi
zh_hans: 输出窗口日志级别
zh_hant: 輸出視窗記錄層級

# Setting_LogLevelError
source: Error
cs: Chyba
de: Fehler
fr: Erreur
it: Errore
ja: エラー
ko: 오류
pl: Błąd
pt_br: Erro
ru: Ошибка
tr: Hata
zh_hans: 错误
zh_hant: 錯誤

# Setting_LogLevelInformation
source: Information
cs: Informace
de: Informationen
es: Información
fr: Informations
it: Informazioni
ja: 情報
ko: 정보
pl: Informacje
pt_br: Informação
ru: Информация
tr: Bilgi
zh_hans: 信息
zh_hant: 資訊

# Setting_LogLevelNone
source: None
cs: Žádné
de: Keine
es: Ninguno
fr: Aucun
it: Nessuno
ja: なし
ko: 없음
pl: Brak
pt_br: Nenhum
ru: Нет
tr: Yok
zh_hans: 无
zh_hant: 無

# Setting_LogLevelTrace
source: Trace
cs: Trasování
de: Ablaufverfolgung
es: Seguimiento
fr: Tracer
it: Traccia
ja: トレース
ko: 추적
pl: Ślad
pt_br: Traço
ru: Трассировка
tr: İzleme
zh_hans: 跟踪
zh_hant: 追蹤

# Setting_LogLevelWarning
source: Warning
cs: Upozornění
de: Warnung
es: Advertencia
fr: Avertissement
it: Avviso
ja: 警告
ko: 경고
pl: Ostrzeżenie
pt_br: Aviso
ru: Предупреждение
tr: Uyarı
zh_hans: 警告
zh_hant: 警告

# Setting_SnippetsAll
source: All
cs: Vše
de: Alle
es: Todo
fr: Tout
it: Tutti
ja: すべて
ko: 전체
pl: Wszystkie
pt_br: Todos
ru: Все
tr: Tümü
zh_hans: 全部
zh_hant: 全部

# Setting_SnippetsCustom
source: Custom
cs: Vlastní
de: Benutzerdefiniert
es: Personalizado
fr: Personnalisé
it: Personalizzato
ja: カスタム
ko: 사용자 지정
pl: Niestandardowe
pt_br: Personalizadas
ru: Настраиваемый
tr: Özel
zh_hans: 自定义
zh_hant: 自訂

# Setting_SnippetsDescription
source: What snippets to include in a razor file. If set to custom, only snippets that are not included with Visual Studio will be shown.
cs: Které fragmenty kódu se mají zahrnout do souboru Razor. Pokud je tato možnost nastavená na vlastní, zobrazí se jenom fragmenty kódu, které nejsou zahrnuty ve Visual Studiu.
de: Welche Ausschnitte in eine Razor-Datei eingeschlossen werden sollen. Bei Festlegung auf "Benutzerdefiniert" werden nur Ausschnitte angezeigt, die nicht in Visual Studio enthalten sind.
es: Qué fragmentos de código se van a incluir en un archivo de Razor. Si se establece en personalizado, solo se mostrarán los fragmentos de código que no se incluyen con Visual Studio.
fr: Extraits de code à inclure dans un fichier Razor. Si la valeur est personnalisée, seuls les extraits de code qui ne sont pas inclus dans Visual Studio sont affichés.
it: Quali frammenti includere in un file Razor. Se impostato su Personalizzato, verranno visualizzati solo i frammenti non inclusi in Visual Studio.
ja: Razor ファイルに含めるスニペット。カスタムに設定すると、Visual Studioに含まれていないスニペットのみが表示されます。
ko: Razor 파일에 포함할 코드 조각입니다. 사용자 지정으로 설정하면 Visual Studio에 포함되지 않은 코드 조각만 표시됩니다.
pl: Jakie fragmenty kodu należy uwzględnić w pliku Razor. Jeśli zostanie ustawiona wartość niestandardowa, będą wyświetlane tylko fragmenty kodu, które nie są dołączone do programu Visual Studio.
pt_br: Quais snippets de código devem ser incluídos em um arquivo Razor. Se definido como personalizado, somente os snippets que não estiverem incluídos no Visual Studio serão mostrados.
ru: Какие фрагменты кода нужно включить в файл Razor. Если настроено пользовательское значение, будут отображаться только фрагменты кода, не включенные в Visual Studio.
tr: Razor dosyasına eklenecek kod parçacıkları. Özel olarak ayarlanırsa, yalnızca Visual Studio’ya dahil edilmemiş kod parçacıkları gösterilir.
zh_hans: 要包含在 razor 文件中的代码片段。如果设置为自定义，则仅显示未包含在 Visual Studio 中的代码片段。
zh_hant: 要包含在 Razor 檔案中的程式碼片段。如果設為自訂，只會顯示未包含在 Visual Studio 中的程式碼片段。

# Setting_SnippetsDisplayName
source: Included Snippets
cs: Zahrnuté fragmenty kódu
de: Enthaltene Ausschnitte
es: Fragmentos de código incluidos
fr: Extraits de code inclus
it: Frammenti inclusi
ja: 含まれているスニペット
ko: 포함된 코드 조각
pl: Uwzględnione fragmenty kodu
pt_br: Snippets Incluídos
ru: Включенные фрагменты кода
tr: Dahil Edilen Kod Parçacıkları
zh_hans: 包含的代码片段
zh_hant: 包含的程式碼片段

# Setting_SnippetsNone
source: None
cs: Žádné
de: Keine
es: Ninguno
fr: Aucune
it: Nessuna
ja: なし
ko: 없음
pl: Brak
pt_br: Nenhum
ru: Нет
tr: Yok
zh_hans: 无
zh_hant: 無

source: Typing
cs: Psaní
de: Eingabe
es: Escribiendo
fr: Saisie
it: Digitazione
ja: 入力
ko: 입력
pl: Wpisywanie
pt_br: Digitação
ru: Ввод с клавиатуры
tr: Yazım
zh_hans: 键入
zh_hant: 正在輸入
