Repository: dotnet/razor
Catalog: src/Razor/src/Microsoft.CodeAnalysis.Razor.Workspaces/Resources/xlf/*.*.xlf
Languages: sr

# ArgumentCannotBeNullOrEmpty
source: Value cannot be null or an empty string.
sr: Değer null veya boş bir dize olamaz.

# Create_Component_FromTag_Title
source: Create component from tag
sr: Etiketten bileşen oluştur

source: Blazor directive attributes
sr: Blazor yönergesi öznitelikleri

source: Diagnostics after:
sr: Şundan sonraki tanılama:

source: Diagnostics before:
sr: Şundan önceki tanılama:

source: directive
sr: yönerge

# DirectiveSnippetDescription
source: Insert a directive code snippet [Tab] to navigate between elements, [Enter] to complete
sr: Yönerge kod parçacığı ekle öğeler arasında gezinmek için [Tab], tamamlamak için [Enter] seçeneğini belirleyin

# Edit_at_adds
source: Edit at {0} adds the non-whitespace content '{1}'.
sr: {0} konumunda düzenleme, '{1}' boşluk dışı içeriğini ekler.

# Edit_at_deletes
source: Edit at {0} deletes the non-whitespace content '{1}'.
sr: {0} konumunda düzenleme, '{1}' boşluk dışı içeriğini siler.

# ExtractTo_CodeBehind_Title
source: Extract block to code behind
sr: Bloğu arkadaki koda ayıkla

# ExtractTo_Component_Title
source: Extract element to new component
sr: Öğeyi yeni bileşene ayıklayın

# Format_operation_changed_diagnostics
source: A format operation is being abandoned because it would introduce or remove one of more diagnostics.
sr: Bir veya daha fazla tanılamayı ortaya çıkarabileceği veya kaldırabileceği için biçimlendirme işlemi bırakılıyor.

# Format_operation_changed_nonwhitespace
source: A format operation is being abandoned because it would add or delete non-whitespace content.
sr: Boşluk dışı içeriği ekleyebileceği veya silebileceği için biçimlendirme işlemi bırakıl.

# Generate_Async_Event_Handler_Title
source: Generate Async Event Handler '{0}'
sr: '{0}' Asenkron Olay İşleyicisini Oluştur

# Generate_Event_Handler_Title
source: Generate Event Handler '{0}'
sr: '{0}' Olay İşleyicisi Oluştur

# IncompatibleProject_MiscFiles
source: The Razor editor utilizes the Razor Source Generator. {0} appears to not be part of any project, so the source generator is not present and the editing experience will be limited. No more messages will be logged for this scenario.
sr: Razor düzenleyici, Razor Kaynak Oluşturucuyu kullanır. {0} herhangi bir projenin parçası değil gibi görünüyor, bu nedenle kaynak oluşturucu mevcut değildir ve düzenleme deneyimi sınırlı olacaktır. Bu senaryo için başka mesajlar günlüğe kaydedilmeyecektir.

# IncompatibleProject_NoAdditionalFiles
source: The Razor editor utilizes the Razor Source Generator, which requires *.razor and *.cshtml files to be AdditionalFiles in the project. {0} appears to come from '{1}', which has no Razor documents that are AdditionalFiles, so the editing experience will be limited. Is it using the Razor SDK? No more messages will be logged for this project.
sr: Razor düzenleyici, *.razor ve *.cshtml dosyalarının projede AdditionalFiles olmasını gerektiren Razor Kaynak Oluşturucuyu kullanır. {0}, AdditionalFile olan herhangi bir Razor belgesine sahip olmayan '{1}' dosyasından geliyor gibi görünüyor, bu nedenle düzenleme deneyimi sınırlı olacaktır. Razor SDK'sını kullanıyor mu? Bu proje için başka mesajlar günlüğe kaydedilmeyecektir.

# IncompatibleProject_NotAnAdditionalFile
source: The Razor editor utilizes the Razor Source Generator, which requires *.razor and *.cshtml files to be AdditionalFiles in the project. {0} appears to come from '{1}', which has Razor documents but this file is not an AdditionalFile, so the editing experience will be limited. No more messages will be logged for this project.
sr: Razor düzenleyici, *.razor ve *.cshtml dosyalarının projede AdditionalFiles olmasını gerektiren Razor Kaynak Oluşturucuyu kullanır. {0}, Razor belgelerine sahip olan '{1}' dosyasından geliyor gibi görünüyor, ancak bu dosya bir AdditionalFile değildir, bu nedenle düzenleme deneyimi sınırlı olacaktır. Bu proje için başka mesajlar günlüğe kaydedilmeyecektir.

source: Invalid offset.
sr: Geçersiz uzaklık.

# Language_Services_Missing_Service
source: Razor language services not configured properly, missing language service '{0}'.
sr: Razor dil hizmetleri düzgün yapılandırılmadı, '{0}' dil hizmeti eksik.

source: Not available in
sr: Şurada kullanılamaz:

# PositionCharacter_Outside_Range
source: Character '{0}' outside of the {1} range of '{2}' was queried. The document may not be up to date.
sr: '{2}' {1} aralığının dışındaki '{0}' karakteri sorgulandı. Belge güncel olmayabilir.

# PositionLine_Outside_Range
source: Line '{0}' outside of the {1} range of '{2}' was queried. The document may not be up to date.
sr: {1} / '{2}' aralığının dışındaki '{0}' satırı sorgulandı. Belge güncel olmayabilir.

# Promote_using_directive_to
source: Promote using directive to {0}
sr: Yönergeyi şu sürüme yükseltmeyi destekleyin: {0}

# Simplify_Tag_To_SelfClosing_Title
source: Simplify tag to self-closing
sr: Etiketi kendi kendine kapatacak şekilde basitleştir

# TagHelper_Attribute_Glyph
source: Razor TagHelper Attribute Glyph
sr: Razor TagHelper Öznitelik Karakteri

# TagHelper_Element_Glyph
source: Razor TagHelper Element Glyph
sr: Razor TagHelper Element Karakteri

# ReTrigger_Completions_Title
source: "Re-trigger completions..."
sr: "Tamamlamaları yeniden tetikleyin..."

# Unknown_RazorMetaCode
source: Attempted to visit a RazorMetaCode other than '{' or '}'.
sr: '{' or '}' dışında bir RazorMetaCode ziyaret edilmeye çalışıldı.

source: Unknown mapping behavior
sr: Bilinmeyen eşleme davranışı

source: Unsupported Razor extension: '{0}'.
sr: Desteklenmeyen Razor uzantısı: '{0}'.

# Unsupported_argument_kind
source: Unsupported argument kind: '{0}'.
sr: Desteklenmeyen bağımsız değişken tipi: '{0}'.

# Unsupported_argument_type
source: Unsupported argument type: '{0}'.
sr: Desteklenmeyen bağımsız değişken türü: '{0}'.

# Unsupported_razor_project_info_version_encountered
source: Unsupported razor project info version encounted.
sr: Desteklenmeyen razor proje bilgileri sürümüyle karşılaşıldı.

source: Wrap attributes
sr: Öznitelikleri kaydır
