Repository: dotnet/razor
Catalog: src/Razor/src/Microsoft.AspNetCore.Razor.LanguageServer/xlf/RazorLS.Resources.*.xlf
Languages: de

source: Blazor directive attributes
de: Attribute für Blazor-Direktiven

# Create_Component_FromTag_Title
source: Create component from tag
de: Komponente aus Tag erstellen

# Document_Not_Found
source: Document {0} was not found.
de: Dokument „{0}“ wurde nicht gefunden.

# ExtractTo_CodeBehind_Title
source: Extract block to code behind
de: Block auf CodeBehind extrahieren

source: Invalid offset.
de: Ungültiger Offset.

# PositionIndex_Outside_Range
source: Line '{0}' outside of the {1} range of '{2}' was queried. The document may not be up to date.
de: Die Zeile "{0}" außerhalb des {1} Bereichs von "{2}" wurde abgefragt. Das Dokument ist möglicherweise nicht auf dem neuesten Stand.

# ReTrigger_Completions_Title
source: "Re-trigger completions..."
de: "Abschlüsse erneut auslösen..."

# TagHelper_Attribute_Glyph
source: Razor TagHelper Attribute Glyph
de: Razor TagHelper-Attributsymbol

# TagHelper_Element_Glyph
source: Razor TagHelper Element Glyph
de: Razor TagHelper-Elementsymbol

# Unknown_RazorMetaCode
source: Attempted to visit a RazorMetaCode other than '{' or '}'.
de: Es wurde versucht, einen anderen RazorMetaCode als "{" oder "}" zu besuchen.

source: Unknown mapping behavior
de: Unbekanntes Zuordnungsverhalten

# Version_Should_Not_Be_Null
source: Provided version should not be null.
de: Die angegebene Version darf nicht NULL sein.
