Repository: dotnet/razor
Catalog: src/Shared/Microsoft.AspNetCore.Razor.Utilities.Shared/Resources/xlf/*.*.xlf
Languages: sr

source: {0} ('{1}') must be a non-negative and non-zero value.
sr: {0} ('{1}') debe ser un valor no negativo y distinto de cero.

source: {0} ('{1}') must be a non-negative value.
sr: {0} ('{1}') debe ser un valor no negativo.

source: {0} ('{1}') must be a non-zero value.
sr: {0} ('{1}') debe ser un valor distinto de cero.

source: {0} ('{1}') must be equal to '{2}'.
sr: {0} ('{1}') debe ser igual a '{2}'.

source: {0} ('{1}') must be greater than '{2}'.
sr: {0} ('{1}') debe ser mayor que '{2}'.

source: {0} ('{1}') must be greater than or equal to '{2}'.
sr: {0} ('{1}') debe ser mayor o igual que '{2}'.

source: {0} ('{1}') must be less than '{2}'.
sr: {0} ('{1}') debe ser menor que '{2}'.

source: {0} ('{1}') must be less than or equal to '{2}'.
sr: {0} ('{1}') debe ser menor o igual que '{2}'.

source: {0} ('{1}') must not be equal to '{2}'.
sr: {0} ('{1}') no debe ser igual a '{2}'.

# Cannot_advance_past_end_of_the_buffer_which_has_a_size_of_0
source: Cannot advance past the end of the buffer, which has a size of {0}.
sr: No se puede avanzar más allá del final del búfer, que tiene un tamaño de {0}.

source: Cannot allocate a buffer of size {0}.
sr: No se puede asignar un búfer de tamaño {0}.

source: Contains more than one element
sr: Contiene más de un elemento

source: Contains more than one matching element
sr: Contiene más de un elemento coincidente

source: Contains no elements
sr: No contiene elementos

source: Contains no matching elements
sr: No contiene elementos coincidentes

source: Destination is too short.
sr: El destino es demasiado corto.

source: Expected '{0}' to be non-null.
sr: Se esperaba que el '{0}' no fuera null.

source: Expected condition to be false.
sr: Se esperaba que la condición fuera false.

source: Expected condition to be true.
sr: Se esperaba que la condición fuera true.

source: File='{0}', Line={1}
sr: Archivo=''{0}'', Línea={1}

source: Non-negative number required.
sr: Se requiere un número no negativo.

source: The value cannot be an empty string.
sr: El valor no puede ser una cadena vacía.

# The_value_cannot_be_an_empty_string_composed_entirely_of_whitespace
source: The value cannot be an empty string or composed entirely of whitespace.
sr: El valor no puede ser una cadena vacía ni estar compuesto únicamente de espacios en blanco.

source: This program location is thought to be unreachable.
sr: Se considera que esta ubicación del programa es inaccesible.

source: Unsupported type: '{0}'.
sr: Tipo no compatible: '{0}'.
